БИТУправление_медицинским_центром_демо/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.Прием</types>
      <types>CatalogRef.МедицинскиеКарты</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Сертификаты</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.КартыСкидок</types>
      <types>DocumentRef.ПрохождениеМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/УпаковкиМаркируемогоТовара/УпаковкиМаркируемогоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиМаркируемогоТовара</name>
  <attributes>
    <name>НомерУпаковки</name>
    <type>
      <types>DefinedType.НомерУпаковкиМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НомерСерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПромаркированаДляЦелейМДЛП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/ОбработкаТабличнойЧастиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьДанныеПоШтрихкодамУпаковок(Штрихкоды, КэшированныеЗначения, ПараметрыДействия) Экспорт
	
	ДанныеШтрихкодов = Новый ТаблицаЗначений;
	ДанныеШтрихкодов.Колонки.Добавить("Штрихкод"     , ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ДанныеШтрихкодов.Колонки.Добавить("НомерУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(27));
	ДанныеШтрихкодов.Колонки.Добавить("GTIN"         , ОбщегоНазначения.ОписаниеТипаСтрока(14));
	ДанныеШтрихкодов.Колонки.Добавить("НомерСерии"   , ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ДанныеШтрихкодов.Колонки.Добавить("ГоденДо"      , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Для Каждого ДанныеШтрихкода Из Штрихкоды Цикл
		
		НоваяСтрока = ДанныеШтрихкодов.Добавить();
		НоваяСтрока.Штрихкод      = ДанныеШтрихкода.Штрихкод;
		НоваяСтрока.НомерУпаковки = ДанныеШтрихкода.SGTIN;
		НоваяСтрока.GTIN          = ДанныеШтрихкода.GTIN;
		НоваяСтрока.НомерСерии    = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеШтрихкода, "Серия");
		НоваяСтрока.ГоденДо       = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеШтрихкода, "ГоденДо");
		
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Штрихкоды.Штрихкод КАК Штрихкод,
	                      |	Штрихкоды.НомерУпаковки КАК НомерУпаковки,
	                      |	Штрихкоды.GTIN КАК GTIN,
	                      |	Штрихкоды.НомерСерии КАК НомерСерии,
	                      |	Штрихкоды.ГоденДо КАК ГоденДо
	                      |ПОМЕСТИТЬ ДанныеШтрихкодов
	                      |ИЗ
	                      |	&Штрихкоды КАК Штрихкоды
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	НомерУпаковки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЛОЖЬ КАК НеизвестныйШтрихкод,
	                      |	ДанныеШтрихкодов.Штрихкод КАК Штрихкод,
	                      |	УпаковкиТоваров.Ссылка КАК УпаковкаТовара,
	                      |	УпаковкиТоваров.Номенклатура КАК Номенклатура,
	                      |	УпаковкиТоваров.СерияНоменклатуры КАК СерияНоменклатуры,
	                      |	УпаковкиТоваров.Партия КАК Партия,
	                      |	УпаковкиТоваров.Номенклатура.Упаковка КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	ДанныеШтрихкодов КАК ДанныеШтрихкодов
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиМаркируемогоТовара КАК УпаковкиТоваров
	                      |		ПО (УпаковкиТоваров.НомерУпаковки = ДанныеШтрихкодов.НомерУпаковки)
	                      |			И (УпаковкиТоваров.ГоденДо = ДанныеШтрихкодов.ГоденДо
	                      |				ИЛИ ДанныеШтрихкодов.ГоденДо = ДАТАВРЕМЯ(1, 1, 1)
	                      |					И УпаковкиТоваров.ГоденДо > &ТекущаяДата)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ИСТИНА,
	                      |	ДанныеШтрихкодов.Штрихкод,
	                      |	ЗНАЧЕНИЕ(Справочник.УпаковкиМаркируемогоТовара.ПустаяСсылка),
	                      |	ШтрихкодыНоменклатуры.Владелец,
	                      |	СправочникСерии.Ссылка,
	                      |	"""",
	                      |	ШтрихкодыНоменклатуры.ЕдиницаИзмерения
	                      |ИЗ
	                      |	ДанныеШтрихкодов КАК ДанныеШтрихкодов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
	                      |		ПО (ШтрихкодыНоменклатуры.Штрихкод = ДанныеШтрихкодов.GTIN)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СправочникСерии
	                      |		ПО (СправочникСерии.Владелец = ШтрихкодыНоменклатуры.Владелец)
	                      |			И (СправочникСерии.НомерСерии = ДанныеШтрихкодов.НомерСерии)
	                      |			И (СправочникСерии.ГоденДо = ДанныеШтрихкодов.ГоденДо
	                      |				ИЛИ ДанныеШтрихкодов.ГоденДо = ДАТАВРЕМЯ(1, 1, 1)
	                      |					И СправочникСерии.ГоденДо > &ТекущаяДата)
	                      |			И (СправочникСерии.СерияПромаркированаДляЦелейМДЛП)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиМаркируемогоТовара КАК УпаковкиТоваров
	                      |		ПО (УпаковкиТоваров.НомерУпаковки = ДанныеШтрихкодов.НомерУпаковки)
	                      |			И (УпаковкиТоваров.ГоденДо = ДанныеШтрихкодов.ГоденДо
	                      |				ИЛИ ДанныеШтрихкодов.ГоденДо = ДАТАВРЕМЯ(1, 1, 1)
	                      |					И УпаковкиТоваров.ГоденДо > &ТекущаяДата)
	                      |ГДЕ
	                      |	НЕ &ПропускатьНенайденные
	                      |	И УпаковкиТоваров.Ссылка ЕСТЬ NULL
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ИСТИНА,
	                      |	ДанныеШтрихкодов.Штрихкод,
	                      |	ЗНАЧЕНИЕ(Справочник.УпаковкиМаркируемогоТовара.ПустаяСсылка),
	                      |	СправочникСерии.Владелец,
	                      |	СправочникСерии.Ссылка,
	                      |	"""",
	                      |	СправочникСерии.Владелец.Упаковка
	                      |ИЗ
	                      |	ДанныеШтрихкодов КАК ДанныеШтрихкодов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
	                      |		ПО (ШтрихкодыНоменклатуры.Штрихкод = ДанныеШтрихкодов.GTIN)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СправочникСерии
	                      |		ПО (СправочникСерии.НомерСерии = ДанныеШтрихкодов.НомерСерии)
	                      |			И (СправочникСерии.ГоденДо = ДанныеШтрихкодов.ГоденДо
	                      |				ИЛИ ДанныеШтрихкодов.ГоденДо = ДАТАВРЕМЯ(1, 1, 1)
	                      |					И СправочникСерии.ГоденДо > &ТекущаяДата)
	                      |			И (СправочникСерии.СерияПромаркированаДляЦелейМДЛП)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиМаркируемогоТовара КАК УпаковкиТоваров
	                      |		ПО (УпаковкиТоваров.НомерУпаковки = ДанныеШтрихкодов.НомерУпаковки)
	                      |			И (УпаковкиТоваров.ГоденДо = ДанныеШтрихкодов.ГоденДо
	                      |				ИЛИ ДанныеШтрихкодов.ГоденДо = ДАТАВРЕМЯ(1, 1, 1)
	                      |					И УпаковкиТоваров.ГоденДо > &ТекущаяДата)
	                      |ГДЕ
	                      |	НЕ &ПропускатьНенайденные
	                      |	И УпаковкиТоваров.Ссылка ЕСТЬ NULL
	                      |	И ШтрихкодыНоменклатуры.Владелец ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Штрихкоды", ДанныеШтрихкодов);
	Запрос.УстановитьПараметр("ТекущаяДата", ДобавитьМесяц(НачалоДня(ТекущаяДатаСеанса()), -6));
	Запрос.УстановитьПараметр("ПропускатьНенайденные", ПараметрыДействия.ПропускатьНенайденныеШтрихкоды);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИнформацияПоШтрихкоду = ОбработкаТабличнойЧастиКлиентСервер.СтуктураКэшируемойИнформацииПоШтрихкоду(Выборка.Штрихкод);
		ИнформацияПоШтрихкоду.ШтрихкодУпаковки				= Истина;
		ИнформацияПоШтрихкоду.НеизвестныйШтрихкод			= Выборка.НеизвестныйШтрихкод;
		ИнформацияПоШтрихкоду.УпаковкаМаркированногоТовара	= Выборка.УпаковкаТовара;
		ИнформацияПоШтрихкоду.Номенклатура					= Выборка.Номенклатура;
		ИнформацияПоШтрихкоду.СерияНоменклатуры				= Выборка.СерияНоменклатуры;
		ИнформацияПоШтрихкоду.Партия						= Выборка.Партия;
		ИнформацияПоШтрихкоду.ЕдиницаИзмерения				= Выборка.ЕдиницаИзмерения;
		
		Если ЗначениеЗаполнено(ИнформацияПоШтрихкоду.Номенклатура) И Не ЗначениеЗаполнено(ИнформацияПоШтрихкоду.ЕдиницаИзмерения) Тогда
			ИнформацияПоШтрихкоду.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения(ИнформацияПоШтрихкоду.Номенклатура);
		КонецЕсли;
		
		КэшированныеЗначения.Штрихкоды.Вставить(Выборка.Штрихкод, ИнформацияПоШтрихкоду);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает основную единицу измерения номенклатуры.
Функция ОсновнаяЕдиницаИзмерения(Знач Номенклатура) Экспорт
	ЗапрашиваемыеПараметры = Новый Структура;
	ЗапрашиваемыеПараметры.Вставить("Упаковка");
	ЗапрашиваемыеПараметры.Вставить("ЕдиницаХраненияОстатков"); 
	ЗапрашиваемыеПараметры.Вставить("ЕдиницаТоваров");
	
	ЕдиницаИзмерения = Неопределено;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, ЗапрашиваемыеПараметры);
	Если ЗначениеЗаполнено(Реквизиты.Упаковка) Тогда
		ЕдиницаИзмерения = Реквизиты.Упаковка;		
	ИначеЕсли ЗначениеЗаполнено(Реквизиты.ЕдиницаТоваров) Тогда
		ЕдиницаИзмерения = Реквизиты.ЕдиницаТоваров;
	Иначе
		ЕдиницаИзмерения = Реквизиты.ЕдиницаХраненияОстатков;	
	КонецЕсли;
		
	Возврат ЕдиницаИзмерения;
	
КонецФункции

#КонецОбласти
